MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4011/mcu.h
extern volatile C1RX0B3BITS C1RX0B3bits __attribute__((__sfr__));

#define C1RX0B4 C1RX0B4
extern volatile uint16_t C1RX0B4 __attribute__((__sfr__));
typedef struct tagC1RX0B4BITS {
  uint16_t TXB0D60:1;
  uint16_t TXB0D61:1;
  uint16_t TXB0D62:1;
  uint16_t TXB0D63:1;
  uint16_t TXB0D64:1;
  uint16_t TXB0D65:1;
  uint16_t TXB0D66:1;
  uint16_t TXB0D67:1;
  uint16_t TXB0D70:1;
  uint16_t TXB0D71:1;
  uint16_t TXB0D72:1;
  uint16_t TXB0D73:1;
  uint16_t TXB0D74:1;
  uint16_t TXB0D75:1;
  uint16_t TXB0D76:1;
  uint16_t TXB0D77:1;
} C1RX0B4BITS;
extern volatile C1RX0B4BITS C1RX0B4bits __attribute__((__sfr__));

#define C1RX0CON C1RX0CON
extern volatile uint16_t C1RX0CON __attribute__((__sfr__));
__extension__ typedef struct tagC1RX0CONBITS {
  union {
    struct {
      uint16_t FILHIT0:1;
      uint16_t JTOFF:1;
      uint16_t DBEN:1;
      uint16_t RXRTRRO:1;
      uint16_t :3;
      uint16_t RXFUL:1;
    };
    struct {
      uint16_t FILHIT:1;
      uint16_t :1;
      uint16_t RXB0DBEN:1;
    };
  };
} C1RX0CONBITS;
extern volatile C1RX0CONBITS C1RX0CONbits __attribute__((__sfr__));

#define C1CTRL C1CTRL
extern volatile uint16_t C1CTRL __attribute__((__sfr__));
__extension__ typedef struct tagC1CTRLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ICODE:3;
      uint16_t :1;
      uint16_t OPMODE:3;
      uint16_t REQOP:3;
      uint16_t CANCKS:1;
      uint16_t ABAT:1;
      uint16_t CANSIDL:1;
      uint16_t CANFRZ:1;
      uint16_t CANCAP:1;
    };
    struct {
      uint16_t :1;
      uint16_t ICODE0:1;
      uint16_t ICODE1:1;
      uint16_t ICODE2:1;
      uint16_t :1;
      uint16_t OPMODE0:1;
      uint16_t OPMODE1:1;
      uint16_t OPMODE2:1;
      uint16_t REQOP0:1;
      uint16_t REQOP1:1;
      uint16_t REQOP2:1;
      uint16_t :2;
      uint16_t CSIDL:1;
    };
  };
} C1CTRLBITS;
extern volatile C1CTRLBITS C1CTRLbits __attribute__((__sfr__));

#define C1CFG1 C1CFG1
extern volatile uint16_t C1CFG1 __attribute__((__sfr__));
__extension__ typedef struct tagC1CFG1BITS {
  union {
    struct {
      uint16_t BRP:6;
      uint16_t SJW:2;
    };
    struct {
      uint16_t BRP0:1;
      uint16_t BRP1:1;
      uint16_t BRP2:1;
      uint16_t BRP3:1;
      uint16_t BRP4:1;
      uint16_t BRP5:1;
      uint16_t SJW0:1;
      uint16_t SJW1:1;
    };
  };
} C1CFG1BITS;
extern volatile C1CFG1BITS C1CFG1bits __attribute__((__sfr__));

#define C1CFG2 C1CFG2
extern volatile uint16_t C1CFG2 __attribute__((__sfr__));
__extension__ typedef struct tagC1CFG2BITS {
  union {
    struct {
      uint16_t PRSEG:3;
      uint16_t SEG1PH:3;
      uint16_t SAM:1;
      uint16_t SEG2PHTS:1;
      uint16_t SEG2PH:3;
      uint16_t :3;
      uint16_t WAKFIL:1;
    };
    struct {
      uint16_t PRSEG0:1;
      uint16_t PRSEG1:1;
      uint16_t PRSEG2:1;
      uint16_t SEG1PH0:1;
      uint16_t SEG1PH1:1;
      uint16_t SEG1PH2:1;
      uint16_t :2;
      uint16_t SEG2PH0:1;
      uint16_t SEG2PH1:1;
      uint16_t SEG2PH2:1;
    };
  };
} C1CFG2BITS;
extern volatile C1CFG2BITS C1CFG2bits __attribute__((__sfr__));

#define C1INTF C1INTF
extern volatile uint16_t C1INTF __attribute__((__sfr__));
__extension__ typedef struct tagC1INTFBITS {
  union {
    struct {
      uint16_t RXB0IF:1;
      uint16_t RXB1IF:1;
      uint16_t TXB0IF:1;
      uint16_t TXB1IF:1;
      uint16_t TXB2IF:1;
      uint16_t ERRIF:1;
      uint16_t WAKIF:1;
      uint16_t IRXIF:1;
      uint16_t EWARN:1;
      uint16_t RXWARN:1;
      uint16_t TXWARN:1;
      uint16_t RXBP:1;
      uint16_t TXBP:1;
      uint16_t TXBO:1;
      uint16_t RXB1OVFL:1;
      uint16_t RXB0OVFL:1;
    };
    struct {
      uint16_t RX0IF:1;
      uint16_t RX1IF:1;
      uint16_t TX0IF:1;
      uint16_t TX1IF:1;
      uint16_t TX2IF:1;
      uint16_t :2;
      uint16_t IVRIF:1;
      uint16_t :1;
      uint16_t RXWAR:1;
      uint16_t TXWAR:1;
      uint16_t RXEP:1;
      uint16_t TXEP:1;
      uint16_t :1;
      uint16_t RX1OVR:1;
      uint16_t RX0OVR:1;
    };
  };
} C1INTFBITS;
extern volatile C1INTFBITS C1INTFbits __attribute__((__sfr__));

#define C1INTE C1INTE
extern volatile uint16_t C1INTE __attribute__((__sfr__));
__extension__ typedef struct tagC1INTEBITS {
  union {
    struct {
      uint16_t RXB0IE:1;
      uint16_t RXB1IE:1;
      uint16_t TXB0IE:1;
      uint16_t TXB1IE:1;
      uint16_t TXB2IE:1;
      uint16_t ERRIE:1;
      uint16_t WAKIE:1;
      uint16_t IRXIE:1;
    };
    struct {
      uint16_t RX0IE:1;
      uint16_t RX1IE:1;
      uint16_t TX0IE:1;
      uint16_t TX1IE:1;
      uint16_t TX2IE:1;
      uint16_t :2;
      uint16_t IVRIE:1;
    };
  };
} C1INTEBITS;
extern volatile C1INTEBITS C1INTEbits __attribute__((__sfr__));

#define C1EC C1EC
extern volatile uint16_t C1EC __attribute__((__sfr__));
typedef struct tagC1ECBITS {
  uint16_t REC0:1;
  uint16_t REC1:1;
  uint16_t REC2:1;
  uint16_t REC3:1;
  uint16_t REC4:1;
  uint16_t REC5:1;
  uint16_t REC6:1;
  uint16_t REC7:1;
  uint16_t TEC0:1;
  uint16_t TEC1:1;
  uint16_t TEC2:1;
  uint16_t TEC3:1;
  uint16_t TEC4:1;
  uint16_t TEC5:1;
  uint16_t TEC6:1;
  uint16_t TEC7:1;
} C1ECBITS;
extern volatile C1ECBITS C1ECbits __attribute__((__sfr__));

#define C1RERRCNT C1RERRCNT
extern volatile uint8_t C1RERRCNT __attribute__((__sfr__));
#define C1TERRCNT C1TERRCNT
extern volatile uint8_t C1TERRCNT __attribute__((__sfr__));
#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t SWDTEN:1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t :5;
  uint16_t BGST:1;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t LPOSCEN:1;
      uint16_t :1;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t POST:2;
      uint16_t NOSC:2;
      uint16_t TUN0:1;
      uint16_t TUN1:1;
      uint16_t COSC:2;
      uint16_t TUN2:1;
      uint16_t TUN3:1;
    };
    struct {
      uint16_t :6;
      uint16_t POST0:1;
      uint16_t POST1:1;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t :2;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

