MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4011/mcu.h
#define _C1RX0B4_TXB0D64_POSITION                0x00000004
#define _C1RX0B4_TXB0D64_MASK                    0x00000010
#define _C1RX0B4_TXB0D64_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D65_POSITION                0x00000005
#define _C1RX0B4_TXB0D65_MASK                    0x00000020
#define _C1RX0B4_TXB0D65_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D66_POSITION                0x00000006
#define _C1RX0B4_TXB0D66_MASK                    0x00000040
#define _C1RX0B4_TXB0D66_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D67_POSITION                0x00000007
#define _C1RX0B4_TXB0D67_MASK                    0x00000080
#define _C1RX0B4_TXB0D67_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D70_POSITION                0x00000008
#define _C1RX0B4_TXB0D70_MASK                    0x00000100
#define _C1RX0B4_TXB0D70_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D71_POSITION                0x00000009
#define _C1RX0B4_TXB0D71_MASK                    0x00000200
#define _C1RX0B4_TXB0D71_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D72_POSITION                0x0000000A
#define _C1RX0B4_TXB0D72_MASK                    0x00000400
#define _C1RX0B4_TXB0D72_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D73_POSITION                0x0000000B
#define _C1RX0B4_TXB0D73_MASK                    0x00000800
#define _C1RX0B4_TXB0D73_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D74_POSITION                0x0000000C
#define _C1RX0B4_TXB0D74_MASK                    0x00001000
#define _C1RX0B4_TXB0D74_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D75_POSITION                0x0000000D
#define _C1RX0B4_TXB0D75_MASK                    0x00002000
#define _C1RX0B4_TXB0D75_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D76_POSITION                0x0000000E
#define _C1RX0B4_TXB0D76_MASK                    0x00004000
#define _C1RX0B4_TXB0D76_LENGTH                  0x00000001

#define _C1RX0B4_TXB0D77_POSITION                0x0000000F
#define _C1RX0B4_TXB0D77_MASK                    0x00008000
#define _C1RX0B4_TXB0D77_LENGTH                  0x00000001

#define _C1RX0CON_FILHIT0_POSITION               0x00000000
#define _C1RX0CON_FILHIT0_MASK                   0x00000001
#define _C1RX0CON_FILHIT0_LENGTH                 0x00000001

#define _C1RX0CON_JTOFF_POSITION                 0x00000001
#define _C1RX0CON_JTOFF_MASK                     0x00000002
#define _C1RX0CON_JTOFF_LENGTH                   0x00000001

#define _C1RX0CON_DBEN_POSITION                  0x00000002
#define _C1RX0CON_DBEN_MASK                      0x00000004
#define _C1RX0CON_DBEN_LENGTH                    0x00000001

#define _C1RX0CON_RXRTRRO_POSITION               0x00000003
#define _C1RX0CON_RXRTRRO_MASK                   0x00000008
#define _C1RX0CON_RXRTRRO_LENGTH                 0x00000001

#define _C1RX0CON_RXFUL_POSITION                 0x00000007
#define _C1RX0CON_RXFUL_MASK                     0x00000080
#define _C1RX0CON_RXFUL_LENGTH                   0x00000001

#define _C1RX0CON_FILHIT_POSITION                0x00000000
#define _C1RX0CON_FILHIT_MASK                    0x00000001
#define _C1RX0CON_FILHIT_LENGTH                  0x00000001

#define _C1RX0CON_RXB0DBEN_POSITION              0x00000002
#define _C1RX0CON_RXB0DBEN_MASK                  0x00000004
#define _C1RX0CON_RXB0DBEN_LENGTH                0x00000001

#define _C1CTRL_ICODE_POSITION                   0x00000001
#define _C1CTRL_ICODE_MASK                       0x0000000E
#define _C1CTRL_ICODE_LENGTH                     0x00000003

#define _C1CTRL_OPMODE_POSITION                  0x00000005
#define _C1CTRL_OPMODE_MASK                      0x000000E0
#define _C1CTRL_OPMODE_LENGTH                    0x00000003

#define _C1CTRL_REQOP_POSITION                   0x00000008
#define _C1CTRL_REQOP_MASK                       0x00000700
#define _C1CTRL_REQOP_LENGTH                     0x00000003

#define _C1CTRL_CANCKS_POSITION                  0x0000000B
#define _C1CTRL_CANCKS_MASK                      0x00000800
#define _C1CTRL_CANCKS_LENGTH                    0x00000001

#define _C1CTRL_ABAT_POSITION                    0x0000000C
#define _C1CTRL_ABAT_MASK                        0x00001000
#define _C1CTRL_ABAT_LENGTH                      0x00000001

#define _C1CTRL_CANSIDL_POSITION                 0x0000000D
#define _C1CTRL_CANSIDL_MASK                     0x00002000
#define _C1CTRL_CANSIDL_LENGTH                   0x00000001

#define _C1CTRL_CANFRZ_POSITION                  0x0000000E
#define _C1CTRL_CANFRZ_MASK                      0x00004000
#define _C1CTRL_CANFRZ_LENGTH                    0x00000001

#define _C1CTRL_CANCAP_POSITION                  0x0000000F
#define _C1CTRL_CANCAP_MASK                      0x00008000
#define _C1CTRL_CANCAP_LENGTH                    0x00000001

#define _C1CTRL_ICODE0_POSITION                  0x00000001
#define _C1CTRL_ICODE0_MASK                      0x00000002
#define _C1CTRL_ICODE0_LENGTH                    0x00000001

#define _C1CTRL_ICODE1_POSITION                  0x00000002
#define _C1CTRL_ICODE1_MASK                      0x00000004
#define _C1CTRL_ICODE1_LENGTH                    0x00000001

#define _C1CTRL_ICODE2_POSITION                  0x00000003
#define _C1CTRL_ICODE2_MASK                      0x00000008
#define _C1CTRL_ICODE2_LENGTH                    0x00000001

#define _C1CTRL_OPMODE0_POSITION                 0x00000005
#define _C1CTRL_OPMODE0_MASK                     0x00000020
#define _C1CTRL_OPMODE0_LENGTH                   0x00000001

#define _C1CTRL_OPMODE1_POSITION                 0x00000006
#define _C1CTRL_OPMODE1_MASK                     0x00000040
#define _C1CTRL_OPMODE1_LENGTH                   0x00000001

#define _C1CTRL_OPMODE2_POSITION                 0x00000007
#define _C1CTRL_OPMODE2_MASK                     0x00000080
#define _C1CTRL_OPMODE2_LENGTH                   0x00000001

#define _C1CTRL_REQOP0_POSITION                  0x00000008
#define _C1CTRL_REQOP0_MASK                      0x00000100
#define _C1CTRL_REQOP0_LENGTH                    0x00000001

#define _C1CTRL_REQOP1_POSITION                  0x00000009
#define _C1CTRL_REQOP1_MASK                      0x00000200
#define _C1CTRL_REQOP1_LENGTH                    0x00000001

#define _C1CTRL_REQOP2_POSITION                  0x0000000A
#define _C1CTRL_REQOP2_MASK                      0x00000400
#define _C1CTRL_REQOP2_LENGTH                    0x00000001

